export interface Manager {
  id: string
  name: string
  clients: string[]
}

export const managersData: Manager[] = [
  {
    id: "1234",
    name: "שימי בנודיס",
    clients: [
      "ארתור רובנשטיין 4",
      "ארתור רובנשטיין 2",
      "יחזאל שטרייכמן 1",
      "יחזאל שטרייכמן 3",
      "יחזאל שטרייכמן 9",
      "ישה חפץ 2",
      "ישה חפץ 4",
      "ישה חפץ 6",
      "איזיק שטרן 16",
      "לוי אשכול 108",
      "שאגל 6",
      "שאגל 8",
      "שאגל 11",
      "דה לה ריינה 9",
      "ועד מבנן 8",
    ],
  },
  {
    id: "2345",
    name: "אמיר פאר",
    clients: ["תמר 1", "התוף 5-9 ראשון לציון", "מעגל שלום 27"],
  },
  {
    id: "3456",
    name: "עובדיה יוסף",
    clients: ["יחזקאל שטרייכמן 5", "יחזקאל שטרייכמן 7", "ארתור רובינשטיין 6", "ארתור רובינשטיין 8"],
  },
  {
    id: "4567",
    name: "מקסים זנו",
    clients: [
      "בויאר 3",
      "בן יהודה 90",
      "בן יוסף 26",
      "בני משה 14",
      "בני משה 16",
      "בן יהודה 232",
      "דיזינגוף 126",
      "בצלאל 8 משרדים",
      "הירקון 168",
      "זבוטינסקי 136",
      "משמר הגבול 17",
      "רוטשילד 100",
      "שפרינצק 1",
      "שינקין 59",
      "בלוך 8",
      "משה שרת 16",
      "קרית מורה 65",
      "תרפב 10",
      "תשי 1-3",
      "מרכז פורום",
    ],
  },
  {
    id: "5678",
    name: "לב סמולר",
    clients: ["הגאולה 6", "חניתה 8"],
  },
  {
    id: "6789",
    name: "משה עטייה",
    clients: [
      "טבת 16 מודיעין",
      "יגאל ידין 39 מודיעין",
      "יגאל ידין 41 מודיעין",
      "יגאל ידין 43 מודיעין",
      "מגדל ים 6 מודיעין",
      "שרה אמנו 41 מודיעין",
      "רחל אמנו 28 מודיעין",
      "רחל אמנו 26 מודיעין",
    ],
  },
  {
    id: "7890",
    name: "גיל אופיר",
    clients: [
      "סוקולוב 13 הרצליה",
      "סוקולוב 1 הרצליה",
      "אלונים 14 נתניה",
      "אלונים 16 נתניה",
      "בני בנימין 3 נתניה",
      "בני בנימין 5 נתניה",
      "לוטם 1 נתניה",
      "לוטם 3 נתניה",
      "לוטם 5 נתניה",
      'שז"ר 12 נתניה',
    ],
  },
  {
    id: "8901",
    name: "אודי סבירסקי",
    clients: ["אחילהב 5 ראשון לציון"],
  },
]

export function getManagerById(id: string): Manager | undefined {
  return managersData.find((manager) => manager.id === id)
}

export function getManagerByName(name: string): Manager | undefined {
  return managersData.find((manager) => manager.name === name)
}
